docs/1c-export-mobile/MobileAgent/Documents/МаршрутныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>МаршрутныйЛист</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМаршрутногоЛиста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>В_1с</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Города</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыЗаказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗагружено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗагрузкаМашины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возврат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажиВес</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Реализации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продажи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажиВес</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реализация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплата</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НеХватает</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Завдання</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментар</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/Documents/МаршрутныйЛист/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ДеревоТоваров.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	ОбновитьДеревоТоваров();
	СтатисткаДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказ(Команда)
	//НоваяСтрока 						= Объект.Заказы.Добавить();
	//Элементы.Заказы.ТекущаяСтрока 		= НоваяСтрока.НомерСтроки - 1;
	
	ОповещениеСоздания 					= Новый ОписаниеОповещения("ОбработатьСозданиеЗаказа", ЭтотОбъект);
	ПараметрыЗаполнения 				= Новый Структура;
	ПараметрыЗаполнения.Вставить("МаршрутныйЛист", Объект.Ссылка);	
	ОткрытьФорму("Документ.Заказ.ФормаОбъекта", ПараметрыЗаполнения, Элементы.Заказы.ПодчиненныеЭлементы.ЗаказыЗаказПокупателя, , , , ОповещениеСоздания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыЗаказПокупателяПриИзменении(Элемент)
	
	Попытка
		ТекущийЗаказ 								= Элементы.Заказы.ТекущиеДанные.ЗаказПокупателя;
	Исключение
		ТекущийЗаказ = Элемент;
	КонецПопытки;
	ТекущийКонтрагент 							= КонтрагентЗаказа(ТекущийЗаказ);
	ТекущийГород 								= ГородКонтрагента(ТекущийКонтрагент);
	Элементы.Заказы.ТекущиеДанные.Контрагент 	= ТекущийКонтрагент;
	Элементы.Заказы.ТекущиеДанные.Город 		= ТекущийГород;
    УдалитьТоварЗаказа(ТекущийЗаказ);
	ТоварыЗаказа(ТекущийЗаказ, ТекущийКонтрагент);
	
	ОбновитьДеревоТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСозданиеЗаказа(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда 
		
		НоваяСтрока = Объект.Заказы.Добавить();
		НоваяСтрока.ЗаказПокупателя = РезультатЗакрытия;
		НоваяСтрока.Город = ПолучитьГородКонтрагента(РезультатЗакрытия);
		НоваяСтрока.Контрагент = КонтрагентЗаказа(РезультатЗакрытия);
		Элементы.Заказы.ТекущаяСтрока = НоваяСтрока.НомерСтроки - 1; 

		ЗаказыЗаказПокупателяПриИзменении(НоваяСтрока);
		ЗаписатьПриИзменении();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьГородКонтрагента(РезультатЗакрытия)
	Возврат РезультатЗакрытия.Контрагент.Город;
КонецФункции


&НаСервереБезКонтекста
Функция КонтрагентЗаказа(Заказ)
	
	Возврат Заказ.Контрагент;
	
КонецФункции



&НаСервере
Функция ГородКонтрагента(Контрагент)
	
	Возврат Контрагент.Город;
	
КонецФункции

&НаКлиенте
Процедура УдалитьТоварЗаказа(ТекущийЗаказ)
	
	// Товары
	МассивНаУдаление = Новый Массив;
	Для Каждого СтрТЧ Из Объект.ТоварыЗаказов Цикл 
		Если СтрТЧ.ЗаказПокупателя = ТекущийЗаказ Тогда 
			МассивНаУдаление.Добавить(СтрТЧ);
		КонецЕсли;	
	КонецЦикла;	
	Для Каждого ЭлементМассива Из МассивНаУдаление Цикл 
		Объект.ТоварыЗаказов.Удалить(ЭлементМассива);
	КонецЦикла;		
	
	// Реализации
	МассивНаУдаление = Новый Массив;
	Для Каждого СтрТЧ Из Объект.Реализации Цикл 
		Если СтрТЧ.ЗаказПокупателя = ТекущийЗаказ Тогда 
			МассивНаУдаление.Добавить(СтрТЧ);
		КонецЕсли;	
	КонецЦикла;	
	Для Каждого ЭлементМассива Из МассивНаУдаление Цикл 
		Объект.Реализации.Удалить(ЭлементМассива);
	КонецЦикла;			
	
	// Продажи
	МассивНаУдаление = Новый Массив;
	Для Каждого СтрТЧ Из Объект.Продажи Цикл 
		Если СтрТЧ.ЗаказПокупателя = ТекущийЗаказ Тогда 
			МассивНаУдаление.Добавить(СтрТЧ);
		КонецЕсли;	
	КонецЦикла;	
	Для Каждого ЭлементМассива Из МассивНаУдаление Цикл 
		Объект.Продажи.Удалить(ЭлементМассива);
	КонецЦикла;				
	
	// Оплаты
	МассивНаУдаление = Новый Массив;
	Для Каждого СтрТЧ Из Объект.Оплаты Цикл 
		Если СтрТЧ.ЗаказПокупателя = ТекущийЗаказ Тогда 
			МассивНаУдаление.Добавить(СтрТЧ);
		КонецЕсли;	
	КонецЦикла;	
	Для Каждого ЭлементМассива Из МассивНаУдаление Цикл 
		Объект.Оплаты.Удалить(ЭлементМассива);
	КонецЦикла;					
	
	ЗаписатьПриИзменении();	
	
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьДанныеРеализации(ТекущийДокумент, Оплаты = Неопределено)
	
	// Продажи
	МассивНаУдаление = Новый Массив;
	Для Каждого СтрТЧ Из Объект.Продажи Цикл 
		Если СтрТЧ.Реализация = ТекущийДокумент Тогда 
			МассивНаУдаление.Добавить(СтрТЧ);
		КонецЕсли;	
	КонецЦикла;	
	Для Каждого ЭлементМассива Из МассивНаУдаление Цикл 
		Объект.Продажи.Удалить(ЭлементМассива);
	КонецЦикла;				
	
	// Оплаты  
	Оплаты = Новый Массив;
	МассивНаУдаление = Новый Массив;
	Для Каждого СтрТЧ Из Объект.Оплаты Цикл 
		Если СтрТЧ.Реализация = ТекущийДокумент Тогда 
			
			МассивНаУдаление.Добавить(СтрТЧ);
		КонецЕсли;	
	КонецЦикла;	
	Для Каждого ЭлементМассива Из МассивНаУдаление Цикл 
		Объект.Оплаты.Удалить(ЭлементМассива);
	КонецЦикла;					
	
КонецПроцедуры	

&НаСервере
Процедура ТоварыЗаказа(Заказ, Контрагент)
	
	ТЗТовары = Заказ.Товары.Выгрузить();
	Для Каждого СтрТЗ Из ТЗТовары Цикл 
		НоваяСтрока 					= Объект.ТоварыЗаказов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЗ);
		НоваяСтрока.ЗаказПокупателя 	= Заказ;
		НоваяСтрока.Контрагент 			= Контрагент;
		НоваяСтрока.Сумма 				= СтрТЗ.Сума;
	КонецЦикла;		

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоТоваров() 
	
	ОбновитьДеревоТоваровНаСервере();
	РазвернутьДерево()
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьДеревоТоваровНаСервере() 
	
	ТЗТовары = Объект.ТоварыЗаказов.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Товары.Контрагент КАК Контрагент,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТовары.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВТТовары.Контрагент КАК Контрагент,
	|	ВТТовары.Номенклатура КАК Номенклатура,
	|	ВТТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТТовары.Количество КАК Количество,
	|	ВТТовары.Цена КАК Цена,
	|	ВТТовары.Сумма КАК Сумма
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма)
	|ПО
	|	ЗаказПокупателя";
	Запрос.УстановитьПараметр("Товары", ТЗТовары);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Дерево = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		ЗначениеВРеквизитФормы(Дерево, "ДеревоТоваров");
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаказыПередУдалением(Элемент, Отказ)
	
	ТекущийЗаказ = Элементы.Заказы.ТекущиеДанные.ЗаказПокупателя;
	УдалитьТоварЗаказа(ТекущийЗаказ);
	ОбновитьДеревоТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаТоварыЗаказов" Тогда 
		ИдентификаторТекСтроки 					= Элементы.ДеревоТоваров.ТекущаяСтрока;
		Элементы.ДеревоТоваров.ТекущаяСтрока 	= Неопределено;
		КоллекцияЭлементовДерева 				= ДеревоТоваров.ПолучитьЭлементы();
		Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
			ИдентификаторСтроки 				= Строка.ПолучитьИдентификатор();
			Элементы.ДеревоТоваров.Развернуть(ИдентификаторСтроки, Истина);
		КонецЦикла;
		Элементы.ДеревоТоваров.ТекущаяСтрока 	= ИдентификаторТекСтроки;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеализацию(Команда)
	
	Попытка
		Данные = Новый Структура("Сделка, МаршрутныйЛист", Объект.Заказы[Элементы.Заказы.ВыделенныеСтроки[0]].ЗаказПокупателя, Объект.Ссылка);
	Исключение
		
	КонецПопытки;
	Если КонтрольРеализации(Данные) Тогда 
		ПоказатьПредупреждение(,"На клієнта " +  Объект.Заказы[Элементы.Заказы.ВыделенныеСтроки[0]].Контрагент + 
						" вже є реалізація по даному заказу і маршрутнику!");
		Возврат;
	КонецЕсли;
	
	
	//ТекущийЭлемент 						= Элементы.Реализации;
	//НоваяСтрока 						= Объект.Реализации.Добавить();
	//НоваяСтрока.ЗаказПокупателя			= Объект.Заказы[Элементы.Заказы.ВыделенныеСтроки[0]].ЗаказПокупателя;
	//
	//НоваяСтрока.Контрагент 				= Объект.Заказы[Элементы.Заказы.ВыделенныеСтроки[0]].Контрагент;
	//ТекущийЭлемент.ТекущаяСтрока 		= Объект.Реализации.Количество() - 1;
	//Элементы.Реализации.Обновить();
	ОповещениеСоздания = Новый ОписаниеОповещения("ОбработатьСозданиеРеализации", ЭтотОбъект);
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Сделка", Объект.Заказы[Элементы.Заказы.ВыделенныеСтроки[0]].ЗаказПокупателя);
	ПараметрыЗаполнения.Вставить("Контрагент", Объект.Заказы[Элементы.Заказы.ВыделенныеСтроки[0]].Контрагент);
	ПараметрыЗаполнения.Вставить("МаршрутныйЛист", Объект.Ссылка);
	ПараметрыЗаполнения.Вставить("Неплановая", Ложь);
	ПараметрыЗаполнения.Вставить("Наложка", ПолучитьНаложку(Объект.Заказы[Элементы.Заказы.ВыделенныеСтроки[0]].ЗаказПокупателя));
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта", ПараметрыЗаполнения, ЭтаФорма, , , , ОповещениеСоздания);	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаложку(Заказ)
	Возврат Заказ.Наложка;
КонецФункции


&НаКлиенте
Процедура СоздатьНеплановуюРеализацию(Команда)
	
	//ТекущийЭлемент 						= Элементы.Реализации;
	//НоваяСтрока 						= Объект.Реализации.Добавить();
	//НоваяСтрока.Контрагент 				= Элементы.Заказы.ТекущиеДанные.Контрагент;
	//ТекущийЭлемент.ТекущаяСтрока 		= Объект.Реализации.Количество() - 1;
	//Элементы.Реализации.Обновить();
	ОповещениеСоздания = Новый ОписаниеОповещения("ОбработатьСозданиеРеализацииНеплановой", ЭтотОбъект);
	ПараметрыЗаполнения = Новый Структура;
	
	
	
	//ПараметрыЗаполнения.Вставить("Сделка", Элементы.Заказы.ТекущиеДанные);
	Попытка
		ПараметрыЗаполнения.Вставить("Контрагент", Элементы.Заказы.ТекущиеДанные.Контрагент);
	Исключение
	КонецПопытки;
	ПараметрыЗаполнения.Вставить("РежимВыбора", Истина);
	ПараметрыЗаполнения.Вставить("МаршрутныйЛист", Объект.Ссылка);	
	ПараметрыЗаполнения.Вставить("Неплановая", Истина);
	ПараметрыЗаполнения.Вставить("Наложка", Ложь);
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта", ПараметрыЗаполнения, ЭтаФорма, , , , ОповещениеСоздания);		
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПустойЗаказ();
	Возврат Документы.Заказ.ПустаяСсылка();
КонецФункции


&НаКлиенте
Процедура ОбработатьСозданиеРеализации(ДокументСоздан, Параметры) Экспорт 
	
	
	
	//ТекущийЭлемент 						= Элементы.Реализации;
	НоваяСтрока 						= Объект.Реализации.Добавить();
	НоваяСтрока.ЗаказПокупателя			= ПолучитьРеквизитОбъекта(ДокументСоздан, "Сделка");
	НоваяСтрока.Реализация = ДокументСоздан;
	НоваяСтрока.Контрагент 				= КонтрагентЗаказа(ДокументСоздан);
			
	
	Если КонтрагентЗаказа(НоваяСтрока.Реализация) <> КонтрагентЗаказа(НоваяСтрока.ЗаказПокупателя) Тогда 
		НоваяСтрока.ЗаказПокупателя = ПолучитьПустойЗаказ();
	КонецЕсли;
	
	
	ПроданныеТовары(НоваяСтрока.Реализация, НоваяСтрока.ЗаказПокупателя, НоваяСтрока.Контрагент);
	ТекущийЭлемент.ТекущаяСтрока 		= Объект.Реализации.Количество() - 1;

	Элементы.Реализации.Обновить();

	ЗаписатьПриИзменении();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитОбъекта(ДокументСоздан, ИмяРеквизита)
	Возврат ДокументСоздан[ИмяРеквизита];
КонецФункции


&НаКлиенте
Процедура ОбработатьСозданиеРеализацииНеплановой(ДокументСоздан, Параметры) Экспорт 
	                                                 //     ДокументСоздан тут порожньо!
	ТекущийЭлемент 						= Элементы.Реализации;
	НоваяСтрока 						= Объект.Реализации.Добавить();
	НоваяСтрока.Контрагент 				= КонтрагентЗаказа(ДокументСоздан);
	НоваяСтрока.Реализация = ДокументСоздан;
	НоваяСтрока.Сумма = ДокументСоздан;
	ТекущийЭлемент.ТекущаяСтрока 		= Объект.Реализации.Количество() - 1;
	
	ПроданныеТовары(ДокументСоздан, Неопределено, НоваяСтрока.Контрагент);
	Элементы.Реализации.Обновить();
	
	ЗаписатьПриИзменении();
	
КонецПроцедуры


&НаКлиенте
Процедура РеализацииРеализацияПриИзменении(Элемент)
	
	//Элементы.Реализации.ТекущиеДанные.Сумма = СуммаДокумента(Элементы.Реализации.ТекущиеДанные.Реализация);
	//ДокументОплаты 			= ОплатаРеализации(Элементы.Реализации.ТекущиеДанные.Реализация);
	//Для Каждого СтрокаОплат Из Объект.Оплаты Цикл 
	//	Если СтрокаОплат.Оплата = ДокументОплаты Тогда 
	//		Возврат;
	//	КонецЕсли;	
	//КонецЦикла;	
	//НоваяСтрока 			= Объект.Оплаты.Добавить();
	//НоваяСтрока.Реализация 	= Элементы.Реализации.ТекущиеДанные.Реализация;
	//НоваяСтрока.Оплата 		= ДокументОплаты;
	//НоваяСтрока.Сумма 		= СуммаДокумента(ДокументОплаты);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацииПередУдалением(Элемент, Отказ)
	Перем Ответ;
	ОбъектыНаУдаление = Новый Массив;
	
	КодОтвета = Вопрос("При видаленні Реалізації з маршрутника, документ видаляється фізично. Також видаляться оплати повязані з ним. Ви скинули всі документи по обміну? Видалити документи фізично?", РежимДиалогаВопрос.ДаНет);
	Если Не КодОтвета = КодВозвратаДиалога.Да Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
	ТекущийДокумент = Элементы.Реализации.ТекущиеДанные.Реализация;
	Если ЗначениеЗаполнено(ТекущийДокумент) И Лев(ТекущийДокумент, 3) <> "<Об" Тогда  
		Строки = Объект.Оплаты.НайтиСтроки(Новый Структура("Реализация", ТекущийДокумент)); 
		ОбъектыНаУдаление.Добавить(ТекущийДокумент);
		Для Каждого мЭлемент Из  Строки Цикл 
			ОбъектыНаУдаление.Добавить(мЭлемент.Оплата);
		КонецЦикла;
		
		
		УдалитьНепосредственно(ОбъектыНаУдаление, Ответ);
		
		Если Ответ.Отказ Тогда
			ПоказатьПредупреждение(,Ответ.Сообщение);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	УдалитьДанныеРеализации(ТекущийДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПриИзменении(Элемент)
	
	ЗаписатьПриИзменении();
	
КонецПроцедуры

&НаСервере
Функция ОплатаРеализации(Реализация)
	
	ДокументОплаты = Документы.КассовыйОрдер.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассовыйОрдер.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КассовыйОрдер КАК КассовыйОрдер
	|ГДЕ
	|	КассовыйОрдер.Основание = &Основание
	|	И КассовыйОрдер.Проведен";
	Запрос.УстановитьПараметр("Основание", Реализация);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДокументОплаты = Выборка.Ссылка;
	КонецЕсли;	
	
	Возврат ДокументОплаты;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТовар(Команда)
	
	Объект.ТоварыЗаказов.Очистить();
	Для Каждого СтрокаЗаказа Из Объект.Заказы Цикл 
		ТоварыЗаказа(СтрокаЗаказа.ЗаказПокупателя, СтрокаЗаказа.Контрагент);
	КонецЦикла;	
	ОбновитьДеревоТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоКоманда(Команда)
	
	РазвернутьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево()
	
	ЭлементыДерева = ДеревоТоваров.ПолучитьЭлементы();
    Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        Элементы.ДеревоТоваров.Развернуть(ЭлементДерева.ПолучитьИдентификатор());
    КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоКоманда(Команда)
	
	СвернутьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево()
	
	ЭлементыДерева = ДеревоТоваров.ПолучитьЭлементы();
    Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        Элементы.ДеревоТоваров.Свернуть(ЭлементДерева.ПолучитьИдентификатор());
    КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыРеализацияПриИзменении(Элемент)
	
	Элементы.Оплаты.ТекущиеДанные.Оплата 	= ОплатаРеализации(Элементы.Оплаты.ТекущиеДанные.Реализация);
	Элементы.Оплаты.ТекущиеДанные.Сумма 	= Суммадокумента(Элементы.Оплаты.ТекущиеДанные.Оплата);
	
КонецПроцедуры

&НаСервере
Функция СуммаДокумента(Документ)
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.КассовыйОрдер") Тогда 
		Возврат Документ.СуммаДокумента;
	Иначе 	
		Возврат Документ.Сума;
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ПроданныеТовары(Продажа, Заказ, Контрагент)
	
	ТЗТовары = Продажа.Товары.Выгрузить();
	Для Каждого СтрТЗ Из ТЗТовары Цикл 
		НоваяСтрока 					= Объект.Продажи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТЗ);
		НоваяСтрока.ЗаказПокупателя 	= Заказ;
		НоваяСтрока.Реализация 			= Продажа;
		НоваяСтрока.Контрагент 			= Контрагент;
		НоваяСтрока.Сумма 				= СтрТЗ.Сума;
		СтрокиЗагрузки 					= Объект.ЗагрузкаМашины.НайтиСтроки(Новый Структура("ЗаказПокупателя, Номенклатура, ХарактеристикаНоменклатуры", Заказ, НоваяСтрока.Номенклатура, НоваяСтрока.ХарактеристикаНоменклатуры));
		Если СтрокиЗагрузки.Количество() Тогда 
			Объект.ЗагрузкаМашины.Удалить(СтрокиЗагрузки[0]);
		КонецЕсли;	
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОплату(Команда)
	Данные = Новый Структура("Основание, ЗаказПокупателя", 
						Объект.Реализации[Элементы.Реализации.ВыделенныеСтроки[0]].Реализация, 
	 					Объект.Реализации[Элементы.Реализации.ВыделенныеСтроки[0]].ЗаказПокупателя);
	
	ТекущиеДанные = Элементы.Реализации.ТекущиеДанные;
	Если КонтрольОплати(Данные) Тогда 
		ПоказатьПредупреждение(,"По даній реалізації вже є оплата!");
		Возврат;
	КонецЕсли;

	ТекущийЭлемент 		= Элементы.Оплаты;
	ОповещениеСоздания 	= Новый ОписаниеОповещения("ОбработатьСозданиеОплаты", ЭтотОбъект);
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("МаршрутныйЛист", Объект.Ссылка);
	//ПараметрыЗаполнения.Вставить("ЗаказПокупателя",  ТекущиеДанные.ЗаказПокупателя);
	//ПараметрыЗаполнения.Вставить("Реализация", ТекущиеДанные.Реализация);
	//ПараметрыЗаполнения.Вставить("Контрагент", ТекущиеДанные.Контрагент);
	//ПараметрыЗаполнения.Вставить("СуммаКОплате", ОпределитьСуммуКОплате(ТекущиеДанные.Сумма, Объект.Реализации[Элементы.Реализации.ВыделенныеСтроки[0]].Реализация));
	ПараметрыЗаполнения.Вставить("ЗаказПокупателя",  Объект.Реализации[Элементы.Реализации.ВыделенныеСтроки[0]].ЗаказПокупателя);
	ПараметрыЗаполнения.Вставить("Реализация", Объект.Реализации[Элементы.Реализации.ВыделенныеСтроки[0]].Реализация);
	ПараметрыЗаполнения.Вставить("Контрагент", Объект.Реализации[Элементы.Реализации.ВыделенныеСтроки[0]].Контрагент);
	ПараметрыЗаполнения.Вставить("СуммаКОплате", ОпределитьСуммуКОплате(Объект.Реализации[Элементы.Реализации.ВыделенныеСтроки[0]].Сумма, Объект.Реализации[Элементы.Реализации.ВыделенныеСтроки[0]].Реализация));

	ОткрытьФорму("Обработка.Оплата.Форма", ПараметрыЗаполнения, Элементы.Реализации.ПодчиненныеЭлементы.РеализацииСумма, , , , ОповещениеСоздания);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСозданиеОплаты(МассивДокументов, Параметры) Экспорт 
	
	Если МассивДокументов <> Неопределено Тогда 
		Для Каждого ЭлементМассива Из МассивДокументов Цикл  
			НоваяСтрока 				= Объект.Оплаты.Добавить();
			Оплата = РосшифроватьОплату(ЭлементМассива);
			//Если Элементы.Реализации.ТекущиеДанные <> Неопределено Тогда
			//	НоваяСтрока.ЗаказПокупателя = Элементы.Реализации.ТекущиеДанные.ЗаказПокупателя;
			//	НоваяСтрока.Реализация 		= Элементы.Реализации.ТекущиеДанные.Реализация;
			//	НоваяСтрока.Контрагент 		= Элементы.Реализации.ТекущиеДанные.Контрагент;
			//КонецЕсли;
			
			НоваяСтрока.ЗаказПокупателя = Оплата.ЗаказПокупателя;
			НоваяСтрока.Реализация 		= Оплата.Реализация;
			НоваяСтрока.Контрагент 		= Оплата.Контрагент;
			НоваяСтрока.Оплата 			= ЭлементМассива;
			НоваяСтрока.Сумма 			= Оплата.Сумма;

			//НоваяСтрока.Сумма 			= СуммаОрдера(ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	ЗаписатьПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыОплатаПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоТоваровПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РосшифроватьОплату(Оплата);
	Данные = Новый Структура();
	Данные.Вставить("ЗаказПокупателя", Оплата.ЗаказПокупателя);
	Данные.Вставить("Реализация", Оплата.Основание);
	Данные.Вставить("Контрагент", Оплата.Контрагент);
	Данные.Вставить("Сумма", СуммаОрдера(Оплата));
	Возврат Данные;
КонецФункции


&НаСервереБезКонтекста
Функция ЗаказыЗаказПокупателяНачалоВыбораНаСервере()
	
	СписокЗаказов 	= Новый СписокЗначений;
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= 
	"ВЫБРАТЬ
	|	МаршрутныйЛистЗаказы.ЗаказПокупателя КАК ЗаказПокупателя
	|ИЗ
	|	Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
	|ГДЕ
	|	НЕ МаршрутныйЛистЗаказы.Ссылка.ПометкаУдаления";
	МассивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказПокупателя");
	Для Каждого ЭлементМассива Из МассивЗаказов Цикл 
		СписокЗаказов.Добавить(ЭлементМассива);
	КонецЦикла;	
	
	Возврат СписокЗаказов;
	
КонецФункции

&НаКлиенте
Процедура ЗаказыЗаказПокупателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	СписокЗаказов 			= ЗаказыЗаказПокупателяНачалоВыбораНаСервере();
	Для Каждого СтрЗаказ Из Объект.Заказы Цикл 
		СписокЗаказов.Добавить(СтрЗаказ.ЗаказПокупателя);
	КонецЦикла;
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("СписокЗаказов", СписокЗаказов);		
	ОповещениеСоздания = Новый ОписаниеОповещения("ОбработатьВыборЗаказа", ЭтотОбъект);
	ОткрытьФорму("Документ.Заказ.ФормаВыбора", ПараметрыЗаполнения, Элементы.Заказы.ПодчиненныеЭлементы.ЗаказыЗаказПокупателя, , , , ОповещениеСоздания);			
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборЗаказа(ДокументСоздан, Параметры) Экспорт 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказ(Команда)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Ключ", Элементы.ДеревоТоваров.ТекущиеДанные.ЗаказПокупателя);	
	ОткрытьФорму("Документ.Заказ.ФормаОбъекта", ПараметрыЗаполнения, , , , , );			
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыЗаказПокупателяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда 
		НоваяСтрока = Элементы.Заказы.ТекущиеДанные;
		ОбработатьВыбранныйЗаказ(НоваяСтрока, ВыбранноеЗначение[0]);
		ВыбранноеЗначение.Удалить(0);
		Для Каждого ЭлементМассива Из ВыбранноеЗначение Цикл 
			НоваяСтрока = Объект.Заказы.Добавить();
			ОбработатьВыбранныйЗаказ(НоваяСтрока, ЭлементМассива);
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбранныйЗаказ(ТекущаяСтрока, ЗаказСсылка)
	
	ТекущаяСтрока.ЗаказПокупателя	= ЗаказСсылка;
	ТекущийКонтрагент 				= КонтрагентЗаказа(ЗаказСсылка);
	ТекущийГород 					= ГородКонтрагента(ТекущийКонтрагент);
	ТекущаяСтрока.Контрагент 		= ТекущийКонтрагент;
	ТекущаяСтрока.Город 			= ТекущийГород;
    УдалитьТоварЗаказа(ЗаказСсылка);
	ТоварыЗаказа(ЗаказСсылка, ТекущийКонтрагент);
	
	ОбновитьДеревоТоваров();	
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьСуммуКОплате(Сумма, Реализация)
	
	СуммаКОплате = Сумма;
	
	Для Каждого СтрОплата Из Объект.Оплаты Цикл
		Если СтрОплата.Реализация = Реализация Тогда 
			СуммаКОплате = СуммаКОплате - СтрОплата.Сумма;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат СуммаКОплате;
	
КонецФункции	

&НаСервереБезКонтекста
Функция СуммаОрдера(ЭлементМассива)
	
	Результат = 0;
	Если ЭлементМассива.ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Приход Тогда 
		Результат = ЭлементМассива.СуммаДокумента;
	Иначе 	
		Результат = ЭлементМассива.СуммаДокумента * (-1) ;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции	

&НаСервереБезКонтекста
Процедура РазрешитьОбменРеализации(Ссылка) 
	ДокОб = Ссылка.ПОлучитьОбъект();
	ДокОб.ВідправленоВВайбер = Истина;
	ДокОб.ВивантажуватиВ1С = Истина;
	ДокОб.Записать();
КонецПроцедуры

#Если МобильноеПриложениеКлиент Тогда
	
&НаКлиенте
Процедура ОтправитьКонтрагенту(Команда)
	ТекущиеДанные = Элементы.Реализации.ТекущиеДанные;
	НомераТелефонов = ТелефонКонтрагента(ТекущиеДанные.Контрагент);
	Если НомераТелефонов.Количество() > 1 Тогда 
		ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
		Если ВыбрЗнач = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		Телефон = ВыбрЗнач.Значение;
	ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
		Телефон = НомераТелефонов[0].Значение;
	КонецЕсли;
	
	НовВз 				= Новый ЗапускПриложенияМобильногоУстройства();
	НовВз.Действие 		= "android.intent.action.SEND";
	НовВз.Приложение 	= "com.viber.voip"; 
	НовВз.ИмяКласса 	= "com.viber.voip.WelcomeShareActivity"; 
	НовВз.Тип 			= "text/plain";
	НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", Общий.ПолучитьТекстСообщенияВайбер(Элементы.Реализации.ТекущиеДанные.Реализация, Истина, Телефон));
	
	НовВз.Запустить(Истина);
	
КонецПроцедуры



&НаКлиенте
Процедура ОтправитьВГрупу(Команда)
	
	
		
	НомераТелефонов = ТелефонКонтрагента(Элементы.Реализации.ТекущиеДанные.Контрагент);
	Если НомераТелефонов.Количество() > 1 Тогда 
		ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
		Если ВыбрЗнач = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		Телефон = ВыбрЗнач.Значение;
	ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
		Телефон = НомераТелефонов[0].Значение;
	КонецЕсли;
	
	Общий.ОбновитьСумаОплатиНаложкою(Элементы.Реализации.ТекущиеДанные.Реализация);

	НовВз 				= Новый ЗапускПриложенияМобильногоУстройства();
	НовВз.Действие 		= "android.intent.action.SEND";
	НовВз.Приложение 	= "com.viber.voip"; 
	НовВз.ИмяКласса 	= "com.viber.voip.WelcomeShareActivity"; 
	НовВз.Тип 			= "text/plain";
	НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", Общий.ПолучитьТекстСообщенияВайбер(Элементы.Реализации.ТекущиеДанные.Реализация, Ложь, Телефон));
	
	НовВз.Запустить(Истина);
	//ДанныеФормыВЗначение(Элементы.Реализации.ТекущиеДанные, Тип("ДокументСсылка.РеализацияТоваровУслуг");
	РазрешитьОбменРеализации(Элементы.Реализации.ТекущиеДанные.Реализация);
	
КонецПроцедуры
#Иначе
	
&НаКлиенте
Процедура ОтправитьКонтрагенту(Команда)
	 
	НомераТелефонов = ТелефонКонтрагента(Элементы.Реализации.ТекущиеДанные.Контрагент);
	Если НомераТелефонов.Количество() > 1 Тогда 
		ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
		Если ВыбрЗнач = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		Телефон = ВыбрЗнач.Значение;
	ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
		Телефон = НомераТелефонов[0].Значение;
	КонецЕсли;
	
	Общий.ОбновитьСумаОплатиНаложкою(Элементы.Реализации.ТекущиеДанные.Реализация);

	Сообщить(Общий.ПолучитьТекстСообщенияВайбер(Элементы.Реализации.ТекущиеДанные.Реализация, Истина, Телефон));
	

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВГрупу(Команда)
	
	НомераТелефонов = ТелефонКонтрагента(Элементы.Реализации.ТекущиеДанные.Контрагент);
	
	Если НомераТелефонов.Количество() > 1 Тогда 
		ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
		Если ВыбрЗнач = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		Телефон = ВыбрЗнач.Значение;
	ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
		Телефон = НомераТелефонов[0].Значение;
	КонецЕсли;
	
	Общий.ОбновитьСумаОплатиНаложкою(Элементы.Реализации.ТекущиеДанные.Реализация);
	РазрешитьОбменРеализации(Элементы.Реализации.ТекущиеДанные.Реализация);
	Сообщить(Общий.ПолучитьТекстСообщенияВайбер(Элементы.Реализации.ТекущиеДанные.Реализация, Ложь, Телефон));
	
КонецПроцедуры
#КонецЕсли

&НаСервере
Функция ТелефонКонтрагента(ТекущийКонтрагент = Неопределено) 
	
	Если ТекущийКонтрагент = Неопределено Тогда 
		Возврат "";
	КонецЕсли;
	
	СЗ = Новый СписокЗначений();
	НомерТелефона = ТекущийКонтрагент.НомерТелефона;
	Если Не ПустаяСтрока(НомерТелефона) Тогда 
		Для Н=1 по СтрЧислоСтрок(НомерТелефона) Цикл
			СЗ.Добавить(СтрПолучитьСтроку(НомерТелефона, Н));
		КонецЦикла;
	КонецЕсли;

	Возврат СЗ;	
	
КонецФункции                   

&НаСервере
//Функция ПолучитьТекстСообщения(ДляКлиента, Телефон = "", ТекущаяРеализация = Неопределено)
//	
//	Если ТекущаяРеализация = Неопределено Тогда 
//		Возврат "";
//	КонецЕсли;	
//	
//	ОбъектРеализации = ТекущаяРеализация.ПолучитьОбъект();
//	Сума = ОбъектРеализации.Товары.Итог("Сума");

//	Сообщение = "";
//	Контрагент = ОбъектРеализации.Контрагент;

//	ДоставкаТекст = "";
//	Если ОбъектРеализации.Доставка = Перечисления.НаявністьДоставки.Почта Тогда 
//		ДоставкаТекст = "Відділення пошти № " + ОбъектРеализации.НомерВідділенняНП;
//	ИначеЕсли ОбъектРеализации.Доставка = Перечисления.НаявністьДоставки.Самовывоз Тогда
//		ДоставкаТекст = "Самовивіз";
//	ИначеЕсли ОбъектРеализации.Доставка = Перечисления.НаявністьДоставки.Доставка Тогда
//		ДоставкаТекст = "Адресна доставка
//		|" + ОбъектРеализации.Контрагент.Адреса
//		
//	КонецЕсли;
//	
//	
//	Если Не ДляКлиента Тогда 		
//		
//		Сообщение = Контрагент.Наименование +"
//		|" + Телефон +"
//		|" + Контрагент.Город.Наименование +"
//		|" + Контрагент.Область.Наименование;
//		
//	КонецЕсли;
//	Сообщение = Сообщение + "
//	|" + ДоставкаТекст +  "
//	|";

//	
//	Для Каждого Элемент Из ОбъектРеализации.Товары Цикл 
//		Вес = Элемент.ХарактеристикаНоменклатуры.Вага;
//		Если Вес = 0 Тогда 
//			Попытка
//				Вес = Число(Строка(Элемент.ХарактеристикаНоменклатуры));
//			Исключение
//				Вес = 20;
//			КонецПопытки;
//		КонецЕсли;
//		
//		Если ДляКлиента Тогда
//			Сообщение  = Сообщение + "
//			|[" + Элемент.Номенклатура.Наименование + "] " 
//			+ Элемент.Количество * Вес + "х" + Элемент.ЦенаПродажиВес + " = " + Элемент.Сума;
//		Иначе
//			Сообщение  = Сообщение + "
//			|[" + Элемент.Номенклатура.Артикул + "] " 
//			+ Элемент.Количество * Вес + "х" + Элемент.ЦенаПродажиВес + " = " + Элемент.Сума;
//			
//		КонецЕсли;
//	КонецЦикла;
//	
//	Оплаты = ПолучитьДанныеПоОплате(ТекущаяРеализация);
//	
//	Сообщение = Сообщение + "
//	|
//	|Загальна сума: " + ОбъектРеализации.Сума + " €"	;
//	
//	Если Оплаты.СуммаУчета > 0 Тогда
//		Сообщение = Сообщение +  "
//		|Оплачено " +  Оплаты.СуммаУчета + " €" + "
//		|Фактична оплата:"; 
//		Для  Каждого СумаОплаты Из Оплаты.Суммы Цикл 
//			Сообщение = Сообщение + ?(ЗначениеЗаполнено(СумаОплаты.Значение), " 
//			|" + СумаОплаты.Значение + " " + СумаОплаты.Ключ, "");  
//		КонецЦикла;
//	КонецЕсли;
//	
//	
//		Взаиморасчеты = Оплаты.Взаиморасчеты; 

//	Сообщение = Сообщение + "
//	|
//	|Курс EUR " + Оплаты.Курс.EUR + "
//	|Курс USD " + Оплаты.Курс.USD + "
//	|
//	|" + Взаиморасчеты.Статус +  " "  + Взаиморасчеты.Сумма + " €" + ?(Взаиморасчеты.Сумма = 0, "", "
//	|Реалізація " + Взаиморасчеты.ВидРеализации);
//	
//	
//	Возврат Сообщение;

//КонецФункции

&НаСервере
Функция  ПолучитьДанныеПоОплате(ТекущаяРеализация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассовыйОрдер.СумаUAH КАК СумаUAH,
		//intrata_wald_24112021 ↓
		|	КассовыйОрдер.СумаUAH_Безнал КАК СумаUAH_Безнал,
		//intrata_wald_24112021 ↑
		|	КассовыйОрдер.СумаEUR КАК СумаEUR,
		|	КассовыйОрдер.СумаUSD КАК СумаUSD,
		|	КассовыйОрдер.КурсUSD КАК КурсUSD,
		|	КассовыйОрдер.КурсEUR КАК КурсEUR,
		|	ДенежныеСредства.Сумма КАК Сумма
		|ИЗ
		|	Документ.КассовыйОрдер КАК КассовыйОрдер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
		|		ПО КассовыйОрдер.Ссылка = ДенежныеСредства.Регистратор
		|ГДЕ
		|	КассовыйОрдер.Основание = &Основание
		|	И КассовыйОрдер.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	КассовыйОрдер.Дата";
	
	Запрос.УстановитьПараметр("Основание", ТекущаяРеализация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Оплаты = Новый Структура("Курс, Суммы, Взаиморасчеты, СуммаУчета", 
	Новый Структура("EUR, USD", ТекущаяРеализация.КурсEUR, ТекущаяРеализация.КурсUSD),
	//intrata_wald_24112021 ↓
	//Новый Структура("EUR, USD, UAH", 0, 0, 0), 
	Новый Структура("EUR, USD, UAH, UAH_Безнал", 0, 0, 0, 0),
	//intrata_wald_24112021 ↑
	Новый Структура("ВидРеализации, Статус, Сумма", "в борг", "Борг", 0), 
	0);
	Суммы = Оплаты.Суммы;
	ПерваяЗапись = Истина;
	Пока Выборка.Следующий() Цикл
		Если ПерваяЗапись Тогда 
			Оплаты.Курс.EUR = Выборка.КурсEUR;
			Оплаты.Курс.USD = Выборка.КурсUSD;
			ПерваяЗапись = Ложь;
		КонецЕсли;
		Суммы.EUR = Суммы.EUR + Выборка.СумаEUR;
		Суммы.USD = Суммы.USD + Выборка.СумаUSD;
		Суммы.UAH = Суммы.UAH + Выборка.СумаUAH;
		Суммы.UAH_Безнал = Суммы.UAH_Безнал + Выборка.СумаUAH_Безнал; //intrata_wald_24112021
		Оплаты.СуммаУчета = Оплаты.СуммаУчета + Выборка.Сумма;
	КонецЦикла;
	
	Взаиморасчеты = Оплаты.Взаиморасчеты; 
	Взаиморасчеты.Сумма = ТекущаяРеализация.Сума - Оплаты.СуммаУчета + ТекущаяРеализация.Контрагент.Борг;
	Если Взаиморасчеты.Сумма < 0 Тогда 
		Взаиморасчеты.Сумма = -1 * Взаиморасчеты.Сумма;  
		Взаиморасчеты.ВидРеализации =  " по передплаті";
		Взаиморасчеты.Статус =  "Передплата";
	КонецЕсли;
	
	Возврат Оплаты;
		
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.ПустаяСсылка() Тогда 
		Объект.СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Составляется;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацииПослеУдаления(Элемент)
	
	ЗаписатьПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПослеУдаления(Элемент)
	
	ЗаписатьПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПослеУдаления(Элемент)
	
	ЗаписатьПриИзменении();
	
КонецПроцедуры


&НаКлиенте
Процедура ВвестиШК(Команда)
	
	СтрокаШК = "";
	Если ВвестиСтроку(СтрокаШК, "Введите ШК вручную") Тогда 
		ОбработкаСканирования(СтрокаШК, Истина, "",);	
	КонецЕсли;
	
	ЗаписатьПриИзменении();
	
КонецПроцедуры


&НаКлиенте
Процедура СканироватьШК(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
	
	ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтаФорма);	
	СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканируйте штрихкоды",ОбработчикСканирования);

	#Иначе
		СтрокаШК = "";
		Если ВвестиСтроку(СтрокаШК, "Введите ШК вручную") Тогда 
			ОбработкаСканирования(СтрокаШК, Истина, "",);	
		КонецЕсли;
		
	#КонецЕсли
	
	ЗаписатьПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	Перем ТекстСообщения;
	
	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	#КонецЕсли

	ТипЦен = ПолучитьТипЦен();
	СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(СокрЛП(Штрихкод), ТипЦен);
	Если СтруктураТовара = "" Тогда 
		Сообщить("Не найден товар " + Штрихкод);
		Возврат;
	КонецЕсли;
	
	Если АктивнаБроньМішка(СтруктураТовара.Характеристика,  ТекстСообщения) Тогда 
		Сообщить(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ДобавитьТовар(СтруктураТовара.Номенклатура, СтруктураТовара.Характеристика, СтруктураТовара.ЕдиницаИзмерения, 1, СокрЛП(Штрихкод), ТипЦен);

КонецПроцедуры

&НаСервере
Функция АктивнаБроньМішка(Мішок, Текст)
	Если ПустаяСтрока(Мішок.ВерсияДанных) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Текст = "Активна бронь мішка до " + Формат(Мішок.ПериодБрони,  "ДФ=dd.MM.yyyy /")  + Мішок.Бронь; 
	Возврат Мішок.ПериодБрони > ТекущаяДата() И Не Мішок.МояБронь 
	
КонецФункции
	
&НаКлиенте
Процедура ДобавитьТовар(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Количество, Штрихкод, ТипЦен, Знач Цена = 0)
	
	СтрокиТовара 	= Объект.ЗагрузкаМашины.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", Номенклатура, ХарактеристикаНоменклатуры));
	НовСтр 			= Неопределено;
	Если СтрокиТовара.Количество() Тогда 
		Сообщить("Товар уже добавлен!");
		Возврат;
	Иначе
		НовСтр 								= Объект.ЗагрузкаМашины.Добавить();
		НовСтр.Номенклатура 				= Номенклатура;
		НовСтр.ХарактеристикаНоменклатуры 	= ХарактеристикаНоменклатуры;
		НовСтр.ЕдиницаИзмерения 			= ЕдиницаИзмерения;
		Вес 								= 20;
		Попытка
			Вес 							= Число(Строка(ХарактеристикаНоменклатуры));
		Исключение
		КонецПопытки;
		НовСтр.Количество 					= Количество;
		НовСтр.Вес 							= Вес;
		НовСтр.Штрихкод 					= Штрихкод;
		Если Цена > 0 Тогда 
			НовСтр.ЦенаПродажиВес 			= Цена;
			НовСтр.Цена 					= Цена * Вес;
		Иначе
			НовСтр.ЦенаПродажиВес 			= Общий.ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, ТипЦен);
			НовСтр.Цена 					= НовСтр.ЦенаПродажиВес * Вес;
		КонецЕсли;
		НовСтр.Сумма 						= Количество * НовСтр.Цена;
		СтрокиВЗаказах 	= Объект.ТоварыЗаказов.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", Номенклатура, ХарактеристикаНоменклатуры));
		Если СтрокиВЗаказах.Количество() Тогда 
			НовСтр.ЗаказПокупателя 			= СтрокиВЗаказах[0].ЗаказПокупателя;	
			НовСтр.Контрагент 				= СтрокиВЗаказах[0].Контрагент;	
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПриИзменении()
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьТипЦен()
	
	Возврат Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001");
	
КонецФункции	

&НаКлиенте
Процедура ОткрытьРеализацию(Команда)
	
	ОповещениеИзменения = Новый ОписаниеОповещения("ОбработатьИзменениеРеализации", ЭтотОбъект);
	ПараметрыЗаполнения = Новый Структура("Ключ", Объект.Реализации[Элементы.Реализации.ВыделенныеСтроки[0]].Реализация);
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта", ПараметрыЗаполнения, Элементы.Реализации.ПодчиненныеЭлементы.РеализацииСумма, , , , ОповещениеИзменения);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеРеализации(ДокументИзменен, Параметры) Экспорт 
	
	УдалитьДанныеРеализации(Элементы.Реализации.ТекущиеДанные.Реализация);	
	ПроданныеТовары(Элементы.Реализации.ТекущиеДанные.Реализация, Элементы.Реализации.ТекущиеДанные.ЗаказПокупателя, Элементы.Реализации.ТекущиеДанные.Контрагент);
	ЗаписатьПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОплату(Команда)
	
	ПараметрыЗаполнения = Новый Структура("Ключ", Объект.Оплаты[Элементы.Оплаты.ВыделенныеСтроки[0]].Оплата);
	ОткрытьФорму("Документ.КассовыйОрдер.ФормаОбъекта", ПараметрыЗаполнения, Элементы.Оплаты.ПодчиненныеЭлементы.ОплатыСумма, , , , );
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВнеплановуюОплату(Команда)
	
	ОповещениеСоздания 	= Новый ОписаниеОповещения("ОбработатьСозданиеОплаты", ЭтотОбъект);
	ПараметрыЗаполнения = Новый Структура;
	
	Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	Если НЕ ВвестиЗначение(Контрагент, "Виберіть клієнта:") Тогда
		Возврат;
	КонецЕсли;
	
	//СуммаКОплате = 0;
	//Если НЕ ВвестиЗначение(СуммаКОплате, "Сумма до оплати:") Тогда
	//	Возврат;
	//КонецЕсли;
	
	ПараметрыЗаполнения.Вставить("Контрагент", Контрагент);
	ПараметрыЗаполнения.Вставить("МаршрутныйЛист", Объект.Ссылка);
	ПараметрыЗаполнения.Вставить("ЗаказПокупателя", ПредопределенноеЗначение("Документ.Заказ.ПустаяСсылка"));
	//ПараметрыЗаполнения.Вставить("Реализация", ПредопределенноеЗначение("Документ.РеализацияТоваровУслуг.ПустаяСсылка"));
	ПараметрыЗаполнения.Вставить("СуммаКОплате", 0);
	ОткрытьФорму("Обработка.Оплата.Форма", ПараметрыЗаполнения,, , , , ОповещениеСоздания);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьСозданнуюОплату(МассивОплат) Экспорт
			 ЗаполнитьСозданнуюОплатуНаСервере(МассивОплат); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСозданнуюОплатуНаСервере(МассивОплат) Экспорт
			Для Каждого ЭлементМассива Из МассивОплат Цикл
			
			НоваяСтрока = Объект.Оплаты.Добавить();
			НоваяСтрока.ЗаказПокупателя = ЭлементМассива.ЗаказПокупателя;			
			НоваяСтрока.Реализация 		= Объект.Ссылка;
			НоваяСтрока.Контрагент 		= ЭлементМассива.Контрагент;
			НоваяСтрока.Оплата 			= ЭлементМассива;
			НоваяСтрока.Сумма 			= ЭлементМассива.СуммаДокумента;

			КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрольРеализации(Параметры)
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Сделка = &Сделка
		|	И РеализацияТоваровУслуг.МаршрутныйЛист = &МаршрутныйЛист";
	
	Запрос.УстановитьПараметр("МаршрутныйЛист", Параметры.МаршрутныйЛист);   
	Запрос.УстановитьПараметр("Сделка", Параметры.Сделка);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий();	
	
КонецФункции

&НаСервереБезКонтекста
Функция КонтрольОплати(Данные)
	
	
	Если Не ЗначениеЗаполнено(Данные.ЗаказПокупателя) 
		И Не  ЗначениеЗаполнено(Данные.Основание) Тогда 
		Возврат Ложь;
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассовыйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КассовыйОрдер КАК КассовыйОрдер
		|ГДЕ
		|	КассовыйОрдер.ЗаказПокупателя = &ЗаказПокупателя
		|	И КассовыйОрдер.Основание = &Основание";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", Данные.ЗаказПокупателя);
	Запрос.УстановитьПараметр("Основание", Данные.Основание);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий();

КонецФункции

&НаСервереБезКонтекста
Процедура УдалитьНепосредственно(МассивОбъектов, Ответ)
	Ответ = Новый Структура("Отказ", Ложь);
	НачатьТранзакцию();
	Для Каждого ОбъектСсылка Из МассивОбъектов Цикл
		
		Если Не ЗначениеЗаполнено(ОбъектСсылка) Тогда 
			Продолжить;
		КонецЕсли;
		
		
		Если ОбъектСсылка.Архив Или ОбъектСсылка.В_1с Тогда 
			Ответ.Вставить("Отказ", Истина);
			Ответ.Вставить("Сообщение", "Документ " + ОбъектСсылка + " синхронізований з 1С!");
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		Попытка
			ОбъектСсылка.ПолучитьОбъект().Удалить();
		Исключение
			Ответ.вставить("Отказ", Истина);
			Ответ.Вставить("Сообщение", ОписаниеОшибки());
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПередУдалением(Элемент, Отказ)
	Перем Ответ;
	ОбъектыНаУдаление = Новый Массив;
	
	КодОтвета = Вопрос("Видалити документ фізично?", РежимДиалогаВопрос.ДаНет);
	Если Не КодОтвета = КодВозвратаДиалога.Да Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОбъектыНаУдаление.Добавить(Элемент.ТекущиеДанные.Оплата);
	УдалитьНепосредственно(ОбъектыНаУдаление, Ответ);
	
	Если Ответ.Отказ Тогда
		ПоказатьПредупреждение(,Ответ.Сообщение);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Процедура СтатисткаДокумента()
	//	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ТоварыЗаказов.Номенклатура КАК Номенклатура,
	//	|	ТоварыЗаказов.Контрагент КАК Контрагент,
	//	|	ТоварыЗаказов.Количество КАК Количество,
	//	|	ТоварыЗаказов.КоличествоЗагружено КАК КоличествоЗагружено
	//	|ПОМЕСТИТЬ ТоварыЗаказов
	//	|ИЗ
	//	|	&ТоварыЗаказов КАК ТоварыЗаказов
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	//	|	ВложенныйЗапрос.Количество - ВложенныйЗапрос.Залишок КАК Количество,
	//	|	ВложенныйЗапрос.Контрагент КАК Контрагент, 
	//	|   ВложенныйЗапрос.Номенклатура.Артикул Как Артикул
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		ТоварыЗаказов.Номенклатура КАК Номенклатура,
	//	|		СУММА(ХарактеристикиНоменклатуры.Залишок) КАК Залишок,
	//	|		ТоварыЗаказов.Количество - ТоварыЗаказов.КоличествоЗагружено КАК Количество,
	//	|		ТоварыЗаказов.Контрагент КАК Контрагент
	//	|	ИЗ
	//	|		ТоварыЗаказов КАК ТоварыЗаказов
	//	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	//	|			ПО ТоварыЗаказов.Номенклатура = ХарактеристикиНоменклатуры.Владелец
	//	|	
	//	|	СГРУППИРОВАТЬ ПО
	//	|		ТоварыЗаказов.Номенклатура,
	//	|		ТоварыЗаказов.Количество - ТоварыЗаказов.КоличествоЗагружено,
	//	|		ТоварыЗаказов.Контрагент) КАК ВложенныйЗапрос
	//	|ГДЕ
	//	|	ВложенныйЗапрос.Количество > 0
	//	|	И ВложенныйЗапрос.Количество - ВложенныйЗапрос.Залишок > 0";
	//	//|СГРУППИРОВАТЬ ПО
	//	//|	ТоварыЗаказов.Номенклатура, ТоварыЗаказов.Номенклатура.Артикул ИМЕЮЩИЕ СУММА(ТоварыЗаказов.Количество - ЕСТЬNULL(Загрузка.Количество, 0)) > 0 ";
	//Запрос.УстановитьПараметр("ТоварыЗаказов", Объект.ТоварыЗаказов.Выгрузить());
	//ТЗ = Запрос.Выполнить().Выгрузить();
	НеХватает = Объект.НеХватает.Итог("Количество");

	ЗагрузкаМашины = Объект.ЗагрузкаМашины.Выгрузить(Новый Структура("Загружен", Истина));
	
		ТекстСтатистики 							= "По документу: ";
	ТекстСтатистики 							= "Заказов: " + Строка(Объект.Заказы.Количество())+ "; ";
	ТекстСтатистики 							= ТекстСтатистики + "заказано: " + Строка(Объект.ТоварыЗаказов.Итог("Количество")) + "; ";
	ТекстСтатистики 							= ТекстСтатистики + "загружено: " + Строка(Объект.ТоварыЗаказов.Итог("КоличествоЗагружено")) + ?(НеХватает > 0, "; ", ".");
	ТекстСтатистики 							= ТекстСтатистики + ?(НеХватает > 0, "не хватает: " + Строка(НеХватает), "") + ?(НеХватает > 0, ".", "");
	Элементы.ДекорацияОпис.Заголовок 	= ТекстСтатистики;	
	
	


КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюОНезаполненныхТоварах(Команда)
	ЭтотОбъект.Записать();
	
		//ЭтотОбъект.Прочитать();
КонецПроцедуры
&НаСервере
Процедура ОбновитьИнформациюОНезаполненныхТоварахНаСервере()
	
	Объект.НеХватает.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВМаршруте.Номенклатура КАК Номенклатура,
		|	ТоварыВМаршруте.Количество КАК Количество,
		|	ЕСТЬNULL(Остатки.Залишок, 0) КАК Залишок
		|ИЗ
		|	(ВЫБРАТЬ
		|		МаршрутныйЛистТоварыЗаказов.Номенклатура КАК Номенклатура,
		|		СУММА(МаршрутныйЛистТоварыЗаказов.Количество) КАК Количество
		|	ИЗ
		|		Документ.МаршрутныйЛист.ТоварыЗаказов КАК МаршрутныйЛистТоварыЗаказов
		|	ГДЕ
		|		МаршрутныйЛистТоварыЗаказов.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		МаршрутныйЛистТоварыЗаказов.Номенклатура) КАК ТоварыВМаршруте
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|			СУММА(ВЫБОР
		|					КОГДА ХарактеристикиНоменклатуры.ПериодБрони > &ТекущаяДата
		|							И НЕ ХарактеристикиНоменклатуры.МояБронь
		|						ТОГДА 0
		|					ИНАЧЕ ХарактеристикиНоменклатуры.Залишок
		|				КОНЕЦ) КАК Залишок
		|		ИЗ
		|			Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|				ПРАВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					МаршрутныйЛистТоварыЗаказов.Номенклатура КАК Номенклатура
		|				ИЗ
		|					Документ.МаршрутныйЛист.ТоварыЗаказов КАК МаршрутныйЛистТоварыЗаказов) КАК ВложенныйЗапрос
		|				ПО ВложенныйЗапрос.Номенклатура = ХарактеристикиНоменклатуры.Владелец
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВложенныйЗапрос.Номенклатура) КАК Остатки
		|		ПО ТоварыВМаршруте.Номенклатура = Остатки.Номенклатура	ГДЕ
		|	ТоварыВМаршруте.Количество > ЕСТЬNULL(Остатки.Залишок, 0)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	//Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию("22,5",,,РезультатЗапроса.Выгрузить()[5].Номенклатура)
	Пока Выборка.Следующий() Цикл
		
		Отбор = Новый Структура("Номенклатура", Выборка.Номенклатура);
		Строки = Объект.ТоварыЗаказов.НайтиСтроки(Отбор);
		Наявність = Выборка.Залишок;
		Для Каждого Элемент Из Строки Цикл 
			НеХватает = 0; 
			Если Элемент.Количество > Наявність Тогда 
				
				НеХватает =  Элемент.Количество - Наявність;
				Наявність = 0;

			Иначе 
				Наявність = Наявність - Элемент.Количество;
				Продолжить;
			КонецЕсли;
			
			СтрокаНеХватает = Объект.НеХватает.Добавить();
			СтрокаНеХватает.ЗаказПокупателя = Элемент.ЗаказПокупателя;
			СтрокаНеХватает.Номенклатура = Элемент.Номенклатура;
			СтрокаНеХватает.Количество = НеХватает;

		КонецЦикла;
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	//Обмен_УправлениеОбменом.ВыполнитьОбменДаннымиВыгрузкаЗаказов(); 
	//Перем ИнфоМаршруты;
	//Попытка
	//	Прокси = СоединениеСБазой.ПолучитьПрокси();
	//	ПарольВхода = Константы.ПарольВхода.Получить();
	//	СтруктураОтправки = Новый ХранилищеЗначения(СформироватьДанныеДляОтправки(), Новый СжатиеДанных(9));
	//	Рез = Прокси.ОбработатьПакетДанных(ПарольВхода,СтруктураОтправки).Получить();   
	//	
	//	Обмен_УправлениеОбменом.УдалитьРегистрацию(Рез.ТаблицаИД);
	//	Если Не Рез.Свойство("ИнфоМаршруты", ИнфоМаршруты) Тогда 
	//		ВызватьИсключение "Нет данных по недостачам";
	//	КонецЕсли;
	//	УИД_Док = Объект.Ссылка.УникальныйИдентификатор();
	//	ЭтотОбъект.Прочитать();
	//	Для Каждого Элемент Из ИнфоМаршруты Цикл 
	//		Если Не УИД_Док = Элемент.Маршрут Тогда 
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Для Каждого Элемент Из Элемент.НеХватает Цикл 
	//			СтрокаНеХватает = Объект.НеХватает.Добавить();
	//			СтрокаНеХватает.ЗаказПокупателя = Документы.Заказ.ПолучитьСсылку(Элемент.Заказ);
	//			СтрокаНеХватает.Номенклатура 	= Справочники.Номенклатура.ПолучитьСсылку(Элемент.Номенклатура);
	//			СтрокаНеХватает.Количество 		= Элемент.НеХватает;
	//		КонецЦикла;
	//	КонецЦикла;
	//Исключение
	//	Сообщить("Помилка при отриманні даних:" + Символы.ПС + ОписаниеОшибки());
	//КонецПопытки;

КонецПроцедуры


&НаКлиенте
Процедура ДекорацияОписНажатие(Элемент)
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаНедостача;
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузкаМашиныПриИзменении(Элемент)
	СтатисткаДокумента();
КонецПроцедуры

&НаСервере
Функция СформироватьДанныеДляОтправки()
	
	
		СтруктураВозврата = Новый Структура;
	//////////////// Маршрутники
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	""ТоварыЗаказов"" КАК ТабЧасть,
	          |	ТоварыЗаказов.Ссылка КАК СсылкаСсылка,
	          |	ТоварыЗаказов.Ссылка.Номер КАК Номер,
	          |	ТоварыЗаказов.Ссылка.Дата КАК Дата,
	          |	ТоварыЗаказов.Ссылка.ДатаПриезда КАК ДатаПриезда,
	          |	ТоварыЗаказов.Ссылка.СтатусДокумента КАК СтатусСсылка,
	          |	ТоварыЗаказов.Ссылка.СуммаДокумента КАК СуммаДокумента,
	          |	ТоварыЗаказов.Ссылка.Комментарий КАК Комментарий,
	          |	ТоварыЗаказов.Ссылка.Проведен КАК Проведен,
	          |	ТоварыЗаказов.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	          |	ТоварыЗаказов.ЗаказПокупателя КАК ЗаказПокупателяСсылка,
	          |	ТоварыЗаказов.Контрагент КАК КонтрагентСсылка,
	          |	ТоварыЗаказов.Номенклатура КАК НоменклатураСсылка,
	          |	ТоварыЗаказов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатурыСсылка,
	          |	ТоварыЗаказов.ЕдиницаИзмерения КАК ЕдиницаИзмеренияСсылка,
	          |	ТоварыЗаказов.Количество КАК Количество,
	          |	ТоварыЗаказов.Цена КАК Цена,
	          |	ТоварыЗаказов.Сумма КАК Сумма,
	          |	NULL КАК РеализацияСсылка,
	          |	NULL КАК ОплатаСсылка,
	          |	ТоварыЗаказов.НомерСтроки КАК НомерСтроки
	          |ПОМЕСТИТЬ ВТМаршрутный
	          |ИЗ
	          |	Документ.МаршрутныйЛист.ТоварыЗаказов КАК ТоварыЗаказов
	          |ГДЕ
	          |	ТоварыЗаказов.Ссылка = &Ссылка
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ
	          |	""Заказы"",
	          |	МаршрутныйЛистЗаказы.Ссылка,
	          |	МаршрутныйЛистЗаказы.Ссылка.Номер,
	          |	МаршрутныйЛистЗаказы.Ссылка.Дата,
	          |	МаршрутныйЛистЗаказы.Ссылка.ДатаПриезда,
	          |	МаршрутныйЛистЗаказы.Ссылка.СтатусДокумента,
	          |	МаршрутныйЛистЗаказы.Ссылка.СуммаДокумента,
	          |	МаршрутныйЛистЗаказы.Ссылка.Комментарий,
	          |	МаршрутныйЛистЗаказы.Ссылка.Проведен,
	          |	МаршрутныйЛистЗаказы.Ссылка.ПометкаУдаления,
	          |	МаршрутныйЛистЗаказы.ЗаказПокупателя,
	          |	МаршрутныйЛистЗаказы.Контрагент,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	МаршрутныйЛистЗаказы.НомерСтроки
	          |ИЗ
	          |	Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
	          |ГДЕ
	          |	МаршрутныйЛистЗаказы.Ссылка = &Ссылка
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ
	          |	""Реализации"",
	          |	МаршрутныйЛистРеализации.Ссылка,
	          |	МаршрутныйЛистРеализации.Ссылка.Номер,
	          |	МаршрутныйЛистРеализации.Ссылка.Дата,
	          |	МаршрутныйЛистРеализации.Ссылка.ДатаПриезда,
	          |	МаршрутныйЛистРеализации.Ссылка.СтатусДокумента,
	          |	МаршрутныйЛистРеализации.Ссылка.СуммаДокумента,
	          |	МаршрутныйЛистРеализации.Ссылка.Комментарий,
	          |	МаршрутныйЛистРеализации.Ссылка.Проведен,
	          |	МаршрутныйЛистРеализации.Ссылка.ПометкаУдаления,
	          |	МаршрутныйЛистРеализации.ЗаказПокупателя,
	          |	МаршрутныйЛистРеализации.Контрагент,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	МаршрутныйЛистРеализации.Сумма,
	          |	МаршрутныйЛистРеализации.Реализация,
	          |	NULL,
	          |	МаршрутныйЛистРеализации.НомерСтроки
	          |ИЗ
	          |	Документ.МаршрутныйЛист.Реализации КАК МаршрутныйЛистРеализации
	          |ГДЕ
	          |	МаршрутныйЛистРеализации.Ссылка = &Ссылка
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ
	          |	""Продажи"",
	          |	МаршрутныйЛистПродажи.Ссылка,
	          |	МаршрутныйЛистПродажи.Ссылка.Номер,
	          |	МаршрутныйЛистПродажи.Ссылка.Дата,
	          |	МаршрутныйЛистПродажи.Ссылка.ДатаПриезда,
	          |	МаршрутныйЛистПродажи.Ссылка.СтатусДокумента,
	          |	МаршрутныйЛистПродажи.Ссылка.СуммаДокумента,
	          |	МаршрутныйЛистПродажи.Ссылка.Комментарий,
	          |	МаршрутныйЛистПродажи.Ссылка.Проведен,
	          |	МаршрутныйЛистПродажи.Ссылка.ПометкаУдаления,
	          |	МаршрутныйЛистПродажи.ЗаказПокупателя,
	          |	МаршрутныйЛистПродажи.Контрагент,
	          |	МаршрутныйЛистПродажи.Номенклатура,
	          |	МаршрутныйЛистПродажи.ХарактеристикаНоменклатуры,
	          |	МаршрутныйЛистПродажи.ЕдиницаИзмерения,
	          |	МаршрутныйЛистПродажи.Количество,
	          |	МаршрутныйЛистПродажи.Цена,
	          |	МаршрутныйЛистПродажи.Сумма,
	          |	NULL,
	          |	NULL,
	          |	МаршрутныйЛистПродажи.НомерСтроки
	          |ИЗ
	          |	Документ.МаршрутныйЛист.Продажи КАК МаршрутныйЛистПродажи
	          |ГДЕ
	          |	МаршрутныйЛистПродажи.Ссылка = &Ссылка
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ
	          |	""Оплаты"",
	          |	МаршрутныйЛистОплаты.Ссылка,
	          |	МаршрутныйЛистОплаты.Ссылка.Номер,
	          |	МаршрутныйЛистОплаты.Ссылка.Дата,
	          |	МаршрутныйЛистОплаты.Ссылка.ДатаПриезда,
	          |	МаршрутныйЛистОплаты.Ссылка.СтатусДокумента,
	          |	МаршрутныйЛистОплаты.Ссылка.СуммаДокумента,
	          |	МаршрутныйЛистОплаты.Ссылка.Комментарий,
	          |	МаршрутныйЛистОплаты.Ссылка.Проведен,
	          |	МаршрутныйЛистОплаты.Ссылка.ПометкаУдаления,
	          |	NULL,
	          |	МаршрутныйЛистОплаты.Оплата.Контрагент,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	МаршрутныйЛистОплаты.Сумма,
	          |	МаршрутныйЛистОплаты.Реализация,
	          |	МаршрутныйЛистОплаты.Оплата,
	          |	МаршрутныйЛистОплаты.НомерСтроки
	          |ИЗ
	          |	Документ.МаршрутныйЛист.Оплаты КАК МаршрутныйЛистОплаты
	          |ГДЕ
	          |	МаршрутныйЛистОплаты.Ссылка = &Ссылка
	          |;
	          |
	          |////////////////////////////////////////////////////////////////////////////////
	          |ВЫБРАТЬ
	          |	РегистрацияОбмена.ИД КАК ИД,
	          |	ВТМаршрутный.ТабЧасть КАК ТабЧасть,
	          |	ВТМаршрутный.СсылкаСсылка КАК СсылкаСсылка,
	          |	ВТМаршрутный.Номер КАК Номер,
	          |	ВТМаршрутный.Дата КАК Дата,
	          |	ВТМаршрутный.ДатаПриезда КАК ДатаПриезда,
	          |	ВТМаршрутный.СтатусСсылка КАК СтатусСсылка,
	          |	ВТМаршрутный.СуммаДокумента КАК СуммаДокумента,
	          |	ВТМаршрутный.Комментарий КАК Комментарий,
	          |	ВТМаршрутный.Проведен КАК Проведен,
	          |	ВТМаршрутный.ПометкаУдаления КАК ПометкаУдаления,
	          |	ВТМаршрутный.ЗаказПокупателяСсылка КАК ЗаказПокупателяСсылка,
	          |	ВТМаршрутный.КонтрагентСсылка КАК КонтрагентСсылка,
	          |	ВТМаршрутный.НоменклатураСсылка КАК НоменклатураСсылка,
	          |	ВТМаршрутный.ХарактеристикаНоменклатурыСсылка КАК ХарактеристикаНоменклатурыСсылка,
	          |	ВТМаршрутный.ЕдиницаИзмеренияСсылка КАК ЕдиницаИзмеренияСсылка,
	          |	ВТМаршрутный.Количество КАК Количество,
	          |	ВТМаршрутный.Цена КАК Цена,
	          |	ВТМаршрутный.Сумма КАК Сумма,
	          |	ВТМаршрутный.РеализацияСсылка КАК РеализацияСсылка,
	          |	ВТМаршрутный.ОплатаСсылка КАК ОплатаСсылка,
	          |	ВТМаршрутный.НомерСтроки КАК НомерСтроки
	          |ИЗ
	          |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаршрутный КАК ВТМаршрутный
	          |		ПО РегистрацияОбмена.Объект = ВТМаршрутный.СсылкаСсылка
	          |
	          |УПОРЯДОЧИТЬ ПО
	          |	НомерСтроки";
	з.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = з.Выполнить(); 
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТаблицаМаршрутных = РезультатЗапроса.Выгрузить();
		
		ТаблицаМаршрутных.Колонки.Добавить("Ссылка");
		ТаблицаМаршрутных.Колонки.Добавить("СтатусДокумента");
		ТаблицаМаршрутных.Колонки.Добавить("ЗаказПокупателя");
		ТаблицаМаршрутных.Колонки.Добавить("РеализацияТоваровУслуг");
		ТаблицаМаршрутных.Колонки.Добавить("ПриходныйКассовыйОрдер");
		ТаблицаМаршрутных.Колонки.Добавить("Контрагент");
		ТаблицаМаршрутных.Колонки.Добавить("Номенклатура");
		ТаблицаМаршрутных.Колонки.Добавить("ХарактеристикаНоменклатуры");
		ТаблицаМаршрутных.Колонки.Добавить("ЕдиницаИзмерения");
		Для Каждого Строка Из ТаблицаМаршрутных Цикл 
			Строка.Ссылка 						= Строка.СсылкаСсылка.УникальныйИдентификатор();
			Строка.СтатусДокумента 				= ?(Строка.СтатусСсылка = Перечисления.СтатусыМаршрутногоЛиста.Составляется, "Составляется", ?(Строка.СтатусСсылка = Перечисления.СтатусыМаршрутногоЛиста.Отправлен, "Отправлен", ?(Строка.СтатусСсылка = Перечисления.СтатусыМаршрутногоЛиста.Завершен, "Завершен", Неопределено)));
			Строка.ЗаказПокупателя  			= ?(Строка.ЗаказПокупателяСсылка = NULL, Документы.Заказ.ПустаяСсылка() ,Строка.ЗаказПокупателяСсылка.УникальныйИдентификатор());
			Строка.РеализацияТоваровУслуг		= ?(Строка.РеализацияСсылка = NULL, Документы.РеализацияТоваровУслуг.ПустаяСсылка(), Строка.РеализацияСсылка.УникальныйИдентификатор());
			Строка.ПриходныйКассовыйОрдер  		= ?(Строка.ОплатаСсылка = NULL, Документы.КассовыйОрдер.ПустаяСсылка(), Строка.ОплатаСсылка.УникальныйИдентификатор());
			Строка.Контрагент  					= ?(Строка.КонтрагентСсылка = NULL, Справочники.Контрагенты.ПустаяСсылка() ,Строка.КонтрагентСсылка.УникальныйИдентификатор());
			Строка.Номенклатура 				= ?(Строка.НоменклатураСсылка = NULL, Справочники.Номенклатура.ПустаяСсылка(), Строка.НоменклатураСсылка.УникальныйИдентификатор());
			Строка.ХарактеристикаНоменклатуры 	= ?(Строка.ХарактеристикаНоменклатурыСсылка = NULL, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), Строка.ХарактеристикаНоменклатурыСсылка.УникальныйИдентификатор());
			Строка.ЕдиницаИзмерения 			= ?(Строка.ЕдиницаИзмеренияСсылка = NULL, Справочники.ЕдиницыИзмерения.ПустаяСсылка(), Строка.ЕдиницаИзмеренияСсылка.УникальныйИдентификатор());
		КонецЦикла;
		ТаблицаМаршрутных.Колонки.Удалить("СсылкаСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("СтатусСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("ЗаказПокупателяСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("РеализацияСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("ОплатаСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("КонтрагентСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("НоменклатураСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("ХарактеристикаНоменклатурыСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("ЕдиницаИзмеренияСсылка");
		СтруктураВозврата.Вставить("МаршрутныеЛисты", ТаблицаМаршрутных);	
	КонецЕсли;
	Возврат СтруктураВозврата;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбновитьИнформациюОНезаполненныхТоварахНаСервере();
	СтатисткаДокумента();

КонецПроцедуры
